src/cf/DocumentJournals/ЭлектроннаяПочта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DocumentJournal>
		<Properties>
			<Name>ЭлектроннаяПочта</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ВходящееПисьмо</xr:Item>
				<xr:Item>Document.ИсходящееПисьмо</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Адресаты</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ПолучателиПисьмаСтрокой</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Важность</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Важность</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Важность</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВидМаршрутизации</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ВидМаршрутизации</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ВидМаршрутизации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДатаОтправкиПолучения</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ДатаПолучения</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ДатаОтправки</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЕстьВложения</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ЕстьВложения</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ЕстьВложения</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НомерСпособаАдресации</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.НомерСпособаАдресации</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.НомерСпособаАдресации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Отправитель</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ОтправительКонтакт</xr:Item>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ОтправительАдресат</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ОтправкаОтменена</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ОтправкаОтменена</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Отправлено</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ДатаОтправки</xr:Item>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ДатаОтправки</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Папка</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Папка</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Папка</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Получатели</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ПолучателиПисьмаСтрокой</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Получено</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ДатаПолучения</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Предмет</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Предмет</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Предмет</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Размер</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Размер</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Размер</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Тема</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Тема</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Тема</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.УчетнаяЗапись</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.УчетнаяЗапись</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/cf/Enums/СостоянияПриглашения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияПриглашения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияЗаписейРабочегоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияЗаписейРабочегоКалендаря</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Принято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодВопросом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DocumentJournals/ЭлектроннаяПочта/Forms/ПросмотрПриглашений/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ФайлСсылка") И ЗначениеЗаполнено(Параметры.ФайлСсылка) Тогда 
		
		ФайлСсылка = Параметры.ФайлСсылка;
		Письмо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФайлСсылка, "ВладелецФайла");
		
		ИдентификаторПриглашения = Неопределено;
		РеквизитыПриглашения = Новый Структура;
		ТекстСообщения = ВстроеннаяПочтаСервер.ПолучитьТекстПриглашения(ФайлСсылка, ИдентификаторПриглашения, РеквизитыПриглашения);
		
		// по ИдентификаторПриглашения найдем запись календаря, и прочитаем статус принятия
		СсылкаЗаписьКалендаря = Неопределено;
		РаботаСРабочимКалендаремСервер.УжеЕстьТакаяЗаписьКалендаря(
			СотрудникиПовтИсп.ВсеСотрудникиТекущегоПользователя(), 
			ИдентификаторПриглашения,
			СсылкаЗаписьКалендаря);  
			
		ОбновитьСтатус();
			
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСтандартнымПриложением(Команда)
	
	ДанныеФайла = РаботаСФайламиВызовСервера.ДанныеФайлаДляОткрытия(ФайлСсылка, Неопределено, 
		УникальныйИдентификатор);
	КомандыРаботыСФайламиКлиент.Открыть(ДанныеФайла, УникальныйИдентификатор);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда) 
	Состояние(НСтр("ru = 'Отправка ответа на приглашение...'"));
	ПринятьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)      
	Состояние(НСтр("ru = 'Отправка ответа на приглашение...'"));
	ОтклонитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПринятьНаСервере()  
	
	// Принято приглашение        
	Состояние = Перечисления.СостоянияПриглашения.Принято;
	ВстроеннаяПочтаСервер.ВыполнитьОтветНаСервере(Письмо, Состояние);  
	УстановитьСостояниеЗаписиКалендаря(Состояние);
	
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНаСервере()
	
	// Принято приглашение
	Состояние = Перечисления.СостоянияПриглашения.НеПринято;
	ВстроеннаяПочтаСервер.ВыполнитьОтветНаСервере(Письмо, Состояние);
	УстановитьСостояниеЗаписиКалендаря(Состояние);

КонецПроцедуры    

&НаСервере
Процедура  УстановитьСостояниеЗаписиКалендаря(Состояние)    
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРабочийКалендарь") Тогда
	
		СостояниеКалендаря = Неопределено;
		Если Состояние = Перечисления.СостоянияПриглашения.НеПринято Тогда
			СостояниеКалендаря = Перечисления.СостоянияЗаписейРабочегоКалендаря.Отклонено;
		ИначеЕсли Состояние = Перечисления.СостоянияПриглашения.Принято Тогда
			СостояниеКалендаря = Перечисления.СостоянияЗаписейРабочегоКалендаря.Принято;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СсылкаЗаписьКалендаря) Тогда
			
			ОбъектЗаписьКалендаря = СсылкаЗаписьКалендаря.ПолучитьОбъект();
			ОбъектЗаписьКалендаря.Состояние = СостояниеКалендаря;  
			ОбъектЗаписьКалендаря.Записать();
			
		Иначе	              
			
			Тема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Письмо, "Тема");		
			
			ИдентификаторПриглашения = Неопределено;     
			РеквизитыПриглашения = Новый Структура;    
			ТекстСообщения = ВстроеннаяПочтаСервер.ПолучитьТекстПриглашения(ФайлСсылка, ИдентификаторПриглашения, РеквизитыПриглашения);
			
			Описание = РаботаС_HTML.ПолучитьТекстИзHTML(ТекстСообщения);	
			ДваПереводаСтроки = Символы.ВК + Символы.ВК; 
			Описание = СтрЗаменить(Описание, ДваПереводаСтроки, Символы.ВК);
			ДваПереводаСтроки = Символы.ПС + Символы.ПС; 
			Описание = СтрЗаменить(Описание, ДваПереводаСтроки, Символы.ПС);
			
			ПометкаУдаления = Ложь;
			
			СсылкаЗаписьКалендаря = РаботаСРабочимКалендаремСервер.СоздатьЗаписьКалендаряПоПредмету(
				Письмо, Сотрудники.ОсновнойСотрудник(), 
				Описание, 
				РеквизитыПриглашения.ДатаНачала, РеквизитыПриглашения.ДатаОкончания, 
				Тема,
				ИдентификаторПриглашения,
				СостояниеКалендаря,
				ПометкаУдаления);
			
		КонецЕсли;	  
		
	КонецЕсли;
		
	ОбновитьСтатус();
	
КонецПроцедуры    	

&НаСервере
Процедура ОбновитьСтатус()

	Элементы.Закрыть.Видимость = Истина;
	Элементы.Принять.Видимость = Ложь;
	Элементы.Отклонить.Видимость = Ложь;   
	
	Элементы.ГруппаИнфо.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(СсылкаЗаписьКалендаря) Тогда  // есть запись календаря
		
		РеквЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаЗаписьКалендаря, "Состояние, ПометкаУдаления");
		Состояние = РеквЗаписи.Состояние;
		ПометкаУдаления = РеквЗаписи.ПометкаУдаления;
		
		Если ПометкаУдаления Тогда
			
			Элементы.ГруппаИнфо.Видимость = Истина;
			Элементы.ДекорацияИнфо.Заголовок = НСтр("ru = 'Собрание отменено организатором'");
			
		ИначеЕсли Состояние <> Перечисления.СостоянияЗаписейРабочегоКалендаря.Отклонено 
			И Состояние <> Перечисления.СостоянияЗаписейРабочегоКалендаря.Принято Тогда
			
			//  покажем кнопки Принять Отклонить
			Элементы.Закрыть.Видимость = Ложь;
			Элементы.Принять.Видимость = Истина;
			Элементы.Отклонить.Видимость = Истина;
			
		Иначе
			
			Элементы.ГруппаИнфо.Видимость = Истина;
			
			Если Состояние = Перечисления.СостоянияЗаписейРабочегоКалендаря.Принято И Не ПометкаУдаления Тогда
				Элементы.ДекорацияИнфо.Заголовок = НСтр("ru = 'Вы приняли приглашение'");
			ИначеЕсли Состояние = Перечисления.СостоянияЗаписейРабочегоКалендаря.Отклонено И Не ПометкаУдаления Тогда
				Элементы.ДекорацияИнфо.Заголовок = НСтр("ru = 'Вы отклонили приглашение'");
			КонецЕсли;	
			
		КонецЕсли;	
		
	Иначе	

		// нет записи календаря -  покажем кнопки Принять Отклонить
		Элементы.Закрыть.Видимость = Ложь;
		Элементы.Принять.Видимость = Истина;
		Элементы.Отклонить.Видимость = Истина;
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти
